apps/cartera-back/logs-dte/soap-get-2026-06-16T22-30-00-052Z.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" 
               xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
               xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <soap:Body>
    <RequestTransaction xmlns="http://www.fact.com.mx/schema/ws">
      <Requestor>8DD96145-60AE-49A1-A947-9417F1BB3C34</Requestor>
      <Transaction>GET_DOCUMENT</Transaction>
      <Country>GT</Country>
      <Entity>98766430</Entity>
      <User>8DD96145-60AE-49A1-A947-9417F1BB3C34</User>
      <UserName>ADMINISTRADOR</UserName>
      <Data1>8FFE13A1-DAAC-4C66-97B2-0E5CAF9EE9F0</Data1>
      <Data2></Data2>
      <Data3>XML</Data3>
    </RequestTransaction>
  </soap:Body>
</soap:Envelope>