solicitud.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Body>
<RequestTransaction xmlns="http://www.fact.com.mx/schema/ws">
<Requestor>12511111-3411-1111-1111-111111321511</Requestor>
<Transaction>CONVERT_NATIVE_XML</Transaction>
<Country>MX</Country>
<Entity>EUN040506RB3</Entity>
<User>12511111-3411-1111-1111-111111321511</User>
<UserName>MX. EUN040506RB3.jacinto</UserName>
<Data1>Contenido_del_XML_Nativo</Data1>
<Data2>PDF XML</Data2>
<Data3> </Data3>
</RequestTransaction>
</soap:Body>
</soap:Envelope>